Repository: GDiaz16/signbank
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: If verified, the site will be updated to include the new sign. Note that this may take some time depending on the level of requests.
fi: Jos viittoma hyväksytään, lisätään se tietokantaan. Tämä saattaa kestää jonkin aikaa riippuen pyynnön luonteesta.

source: You may either upload a video that shows the missing sign or fill in details in a form. In either case, you should enter a meaning and any comments you might have in the text boxes at the bottom of the form.
fi: Lähetä video puuttuvasta viittomasta tai täytä tiedot lomakkeeseen.

source: Video Comment
fi: Videokommentti

source: Video Upload
fi: Lähetä video

source: Upload a video of the sign.
fi: Lähetä video viittomasta.

source: Sign Description
fi: Glossin kuvaus

source: Show Guide
fi: Näytä ohje

source: Using the guide, select the movement symbol/word that best describes this sign. Please choose either: one only (chosen from any category), or a choice from every category.
fi: Käyttäen ohjetta, valitse symboli/sana joka parhaiten kuvailee tätä viittomaa. Valitse jompi kumpi: ainoastaan yksi mistä tahansa kategoriasta, tai vaihtoehto jokaisesta kategoriasta.

source: Please explain the meaning of the new or missing sign, or enter individual English words that have the same meaning as this sign (i.e. keywords).
fi: Selitä viittoman merkitys tai kirjoita englanninkielisiä avainsanoja joilla on sama merkitys kuin tällä viittomalla.

source: Are there any other comments you would like to give about this sign? For example, do you think there are other or extra keyword/s that belong with this sign? If so, please include your comments below.
fi: Onko lisättävää? Liittyykö viittomaan muita avainsanoja? Liitä ne kommentteihisi.

source: Submit Feedback
fi: Lähetä palaute

source: Download video
fi: Lataa video

source: (if video does not play here you may be able to play by downloading)
fi: (jos video ei pyöri, voit yrittää katsoa sen lataamalla)

source: Is there a keyword or keyword/s that DO NOT belong with this sign?
fi: Onko viittomaan kuulumattomia avainsanoja?

source: Please provide the list of keywords below
fi: Listaa avainsanat alapuolelle

source: Optional Questions
fi: Valinnaiset kysymykset

source: Is this sign an %(language)s Sign?
fi: Onko tämä %(language)s:n viittoma?

source: There is currently insufficient feedback stored for this sign to generate a summary according to user groups. Unless a certain number of responses have been received about any particular sign, percentage displays would be misleading.
fi: Yhteenvetoa varten viittomasta ei ole tarpeeksi palautetta käyttäjäryhmien perusteella. Jos vastauksia ei ole tarpeeksi, prosentit saattaisivat olla harhaanjohtavia.

source: Leave Feedback
fi: Anna palautetta

source: Thank you. Your feedback has been saved.
fi: Kiitos palautteestasi.

source: Example: '/about/contact/'. Make sure to have leading and trailing slashes.
fi: Esimerkiksi: '/about/contact/'. Varmista että kauttaviivat löytyvät alusta ja lopusta.

source: This value must contain only letters, numbers, underscores, dashes or slashes.
fi: Tämä arvo voi sisältää ainoastaan kirjaimia, numeroita, alaviivoja, viivoja tai kauttaviivoja.

source: Uploaded video will be converted to Flash
fi: Lähetetty video muutetaan Flash-muotoon

source: Advanced options
fi: Lisävaihtoehdot

source: title
fi: otsikko

source: content
fi: sisältö

source: template name
fi: pohjan nimi

source: Example: 'pages/contact_page.html'. If this isn't provided, the system will use 'pages/default.html'.
fi: Esimerkiksi: 'pages/contact_page.html'. Jos tätä ei anneta, käytetään 'pages/default.html'.

source: publish
fi: julkaise

source: If this is checked, the page will be included in the site menus.
fi: Jos tämä on valittuna, näytetään sivu sivuston valikossa.

source: Leave blank for a top level menu entry. Top level entries that have sub-pages should be empty as they will not be linked in the menu.
fi: Jätä ylätason valikko kohta tyhjäksi. Ylätason merkintöjen joilla on alasivuja, tulisi olla tyhjiä tai niitä ei linkitetä valikkoon.

source: ordering index
fi: järjestysindeksi

source: Used to order pages in the menu
fi: Käytetään sivujen järjestyksen määrittämiseen valikossa

source: This page will only be visible to members of these groups, leave blank to allow anyone to access.
fi: Tämä sivu näkyy vain näiden ryhmien jäsenille, jos haluat antaa kaikille oikeudet, jätä tämä kohta tyhjäksi.

source: page
fi: sivu

source: pages
fi: sivut

source: number
fi: numero

source: Page Video
fi: Sivun video

source: [Edit]
fi: [Editoi]

source: Search the SignBank Dictionary
fi: Etsi Signbankista

source: No Pages
fi: Ei sivuja

source: No pages defined. Login to <a href="/admin"> to create some.
fi: Sivuja ei ole määritelty. Kirjaudu admin-sivulle <a href="/admin"> lisätäksesi määrityksiä.

source: Username
fi: Käyttäjänimi

source: Your Email Address
fi: Sähköpostiosoitteesi

source: Password (again)
fi: Salasana (uudelleen)

source: This username is already taken. Please choose another.
fi: Tämä käyttäjätunnus on jo varattu. Ole hyvä ja valitse toinen.

source: You must type the same password each time
fi: Kirjoita sama salasana joka kerta

source: I have read and agree to the Terms of Service
fi: Olen lukenut ja hyväksyn käyttöehdot

source: You must agree to the terms to register
fi: Sinun täytyy hyväksyä käyttöehdot rekisteröityäksesi

source: This email address is already in use. Please supply a different email address.
fi: Tämä sähköpostiosoite on jo käytössä. Ole hyvä ja valitse toinen osoite.

source: Registration using free email addresses is prohibited. Please supply a different email address.
fi: Rekisteröinti käyttäen ilmaissähköposteja on kielletty. Ole hyvä ja anna toinen sähköpostiosoite.

source: Enter a four digit year, eg. 1984.
fi: Nelinumeroinen vuosi, esim. 1984.

source: is not a valid year
fi: ei ole kelvollinen vuosi

source: is in the future, please enter your year of birth
fi: on tulevaisuudessa, anna syntymävuotesi

source: no
fi: ei

source: Please enter a correct email and password. Note that password is case-sensitive.
fi: Anna kelvollinen sähköpostiosoite ja salasana. Huomaa että salasana isoilla ja pienillä kirjaimilla on eroa.

source: This account is inactive.
fi: Tämä tunnus on ei-aktiivinen.

source: Your Web browser doesn't appear to have cookies enabled. Cookies are required for logging in.
fi: Selaimessasi ei nähtävästi ole Cookiesit sallittuja. Cookieseja tarvitaan sisäänkirjautumiseen.

source: user
fi: käyttäjä

source: activation key
fi: aktivointiavain

source: registration profile
fi: rekisteröitymisprofiili

source: registration profiles
fi: rekisteröitymisprofiilit

source: Registration information
fi: Rekisteröitymistietoa

source: Your Email Address:
fi: Sähköpostiosoitteesi:

source: Registration for
fi: Rekisteröity

source: Your username and password didn't match. Please try again.
fi: Käyttäjätunnus ja salasana eivät täsmänneet. Yritä uudelleen.

source: Thank you for your registration details. An email has been sent to your nominated address. Please check your email for details of how to complete the registration process.
fi: Kiitos rekisteröitymistietojen täyttämisestä. Teille on lähetetty sähköpostia antamaanne osoitteeseen. Lue sähköpostista ohjeet rekisteröinnin loppuun saattamiseen.

source: Converted to mp4:
fi: Muunnettu mp4 muotoon:

source: Video conversion failed
fi: Videon muuntaminen epäonnistui

source: Killing ffmpeg process
fi: Lopetetaan ffmpeg prosessia

source: Conversion of video failed: please try to use a different video format
fi: Videon muuntaminen epäonnistui: yritä uudelleen eri videoformaatilla

source: Error
fi: Virhe

source: Command:
fi: Komento:

source: Video conversion failed on Auslan
fi: Videon muuntaminen epäonnistui

source: Video file in h264 mp4 format
fi: Videotiedosto h264 mp4 muodossa

source: Version
fi: Versio

source: submit
fi: lähetä

source: File:
fi: Tiedosto:

source: Error:
fi: Virhe:
