Repository: GDiaz16/signbank
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: Permission Denied
fi: Käyttöoikeus evätty

source: You do not have permission to view the requested page.
fi: Sinulla ei ole oikeuksia nähdä sivua

source: The requested page was not found on the server. Please use the menu above to navigate to another part of the site. If you continue to experience problems, please contact the webmaster at
fi: Pyydettyä sivua ei löytynyt palvelimelta. Ole hyvä ja käytä valikkoa siirtyäksesi jollekkin sivulle. Jos ongelmat jatkuvat, ota yhteyttä sivuston ylläpitoon

source: Server Error
fi: Palvelinvirhe

source: There's been an error. It's been reported to the site administrators via e-mail and should be fixed shortly. Thanks for your patience.
fi: Tapahtui virhe. Virheestä on tiedotettu ylläpidolle, ja se pyritään korjaamaan mahdollisimman pian. Pahoittelemme tapahtunutta.

source: is licensed under a
fi: on lisensoitu lisenssillä:

source: Logout
fi: Kirjaudu ulos

source: Login
fi: Kirjaudu

source: Sign In
fi: Kirjaudu sisään

source: Email
fi: Sähköposti

source: Password
fi: Salasana

source: Sign in
fi: Kirjaudu sisään

source: Register
fi: Rekisteröidy

source: Register for free to provide feedback on the Signbank.
fi: Rekisteröidy ilmaiseksi antaaksesi palautetta Signbankista

source: Lost Password
fi: Salasana unohtunut

source: If you've lost or forgotten your password, enter your email address here and we'll reset it and send you a reminder.
fi: Jos olet hukannut tai unohtanut salasanasi, kirjoita sähköpostiosoitteesi tähän ja lähetämme sinulle uuden salasanan.

source: Request Password
fi: Palauta salasana

source: Toggle navigation
fi: Navigointi

source: Search gloss
fi: Etsi glossia

source: Search translation
fi: Etsi käännösvastinetta

source: Sign Search
fi: Hae

source: Edit Page
fi: Muokkaa

source: Password reset complete
fi: Salasanan nollaus valmis

source: Your password has been set. You may go ahead and log in now.
fi: Salasanasi on asetettu. Voitte jatkaa kirjautumalla.

source: Log in
fi: Kirjaudu

source: Password reset
fi: Salasanan nollaus

source: Enter new password
fi: Kirjoita uusi salasana

source: Please enter your new password twice so we can verify you typed it in correctly.
fi: Olkaa hyvä ja kirjoittakaa salasananne kahdesti, jotta voimme varmistaa että se on kirjoitettu oikein.

source: New password:
fi: Uusi salasana

source: Confirm password:
fi: Vahvista salasana:

source: Change my password
fi: Muuta salasanaa

source: Password reset unsuccessful
fi: Salasanan nollaus epäonnistui

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
fi: Salasanan nollauslinkki oli epäkelpo, se on saatettu jo käyttää.Ole hyvä ja pyydä uutta salasanan nollaamista.

source: An email has been sent to your address with a new password.
fi: Uusi salasana on lähetetty teidän sähköpostiinne.

source: You're receiving this email because you requested a password reset for your user account at %(site_name)s.
fi: Olette saaneet tämän sähköpostin koska käyttäjätunnuksellanne pyydettiin salasanan nollaamista %(site_name)ssa.

source: Please go to the following page and choose a new password:
fi: Menkää tälle sivulle ja valitkaa uusi salasana:

source: Thanks for using our site!
fi: Kiitos!

source: The %(site_name)s team
fi: %(site_name)s tiimi

source: Home
fi: Etusivu

source: Forgotten your password? Enter your e-mail address below, and we'll reset your password and e-mail the new one to you.
fi: Oletko unohtanut salasanasi? Kirjoita sähköpostiosoitteesi alapuolelle ja me lähetämme sinulle uuden salasanan sähköpostitse.

source: E-mail address:
fi: Sähköposti:

source: Reset my password
fi: Muuta salasana

source: English words matching
fi: Englanninkieliset täsmäävät sanat

source: SEARCH CONTENT
fi: ETSI SISÄLTÖÄ

source: Signbank User Guide
fi: Signbankin käyttöohje

source: This page gives a brief overview of the functionality of the Signbank website.
fi: Tämä sivu antaa yleiskuvan Signbankin toiminnoista.

source: Public View
fi: Julkinen näkymä

source: Relations
fi: Suhteet

source: Relations to other Glosses
fi: Suhde toisiin Glosseihin

source: All Signs
fi: Kaikki viittomat

source: Glosses containing
fi: Sisältyvät Glossit

source: Translations containing
fi: Sisältyvät käännökset

source: Search
fi: Haku

source: Gloss
fi: Glossi

source: Gloss JKL
fi: Glossi JKL

source: Gloss JKL English
fi: Glossi JKL English

source: Gloss HKI
fi: Glossi HKI

source: Gloss HKI English
fi: Glossi HKI English

source: Gloss video
fi: Glossin video

source: Must provide either Gloss JKL or Gloss HKI
fi: Täytyy antaa vähintään toinen: Glossi JKL tai Glossi HKI

source: This Gloss value is already taken. Please choose another.
fi: Tämä Glossin nimi on jo käytössä. Ole hyvä ja valitse toinen.

source: This Gloss JKL value is already taken. Please choose another.
fi: Tämä Glossi JKL arvo on jo käytössä. Ole hyvä ja valitse toinen.

source: This Gloss HKI value is already taken. Please choose another.
fi: Tämä Glossi HKI arvo on jo käytössä. Ole hyvä ja valitse toinen.

source: Unspecified
fi: Määrittelemätön

source: Yes
fi: Kyllä

source: No
fi: Ei

source: Unknown
fi: Tuntematon

source: True
fi: Tosi

source: False
fi: Epätosi

source: All
fi: Kaikki

source: Homonym
fi: Homonyymi

source: Synonym
fi: Synonyymi

source: Variant
fi: Variantti

source: Antonym
fi: Antonyymi

source: Hyponym
fi: Hyponyymi

source: Hypernym
fi: Hypernyymi

source: See Also
fi: Katso myös

source: Translations
fi: Käännösvastineet

source: Translations English
fi: Käännösvastineet englanniksi

source: Has Video
fi: Video on

source: All Definitions Published
fi: Kaikki julkaistut määritelmät

source: Search Definition/Notes
fi: Etsi määritelmiä/merkintöjä

source: Search for gloss of related signs
fi: Etsi yhteenkuuluvien viittomien glossia

source: Search for gloss of foreign signs
fi: Etsi vieraskielisen viittoman glossia

source: Search for gloss with this as morpheme
fi: Etsi glossia jolla on tämä morfeemi

source: Phonology other
fi: Fonologia muu

source: Related to foreign sign or not
fi: Liittyykö vieraskieliseen viittomaan

source: Type of relation
fi: Relaation tyyppi

source: Has morpheme type
fi: Morfeenityyppi löytyy

source: Repeating Movement
fi: Toistuva liike

source: Alternating Movement
fi: Vaihteleva liike

source: Is a proposed new sign
fi: On ehdotettu uusi viittoma

source: Is in Web dictionary
fi: On verkkosanakirjassa

source: Note type
fi: Merkinnän tyyppi

source: Note contains
fi: Merkintä sisältää

source: Source Gloss
fi: Lähdeglossi

source: Target Gloss
fi: Kohdeglossi

source: Type
fi: Tyyppi

source: Related Language
fi: Lainattu kieli

source: Gloss in Related Language
fi: Glossi lainatussa kielessä

source: Parent Gloss
fi: Emoglossi

source: Morpheme
fi: Morfeemi

source: Note
fi: Merkintä

source: Private Note
fi: Yksityinen merkintä

source: Phonology
fi: Fonologia

source: To Do
fi: Tehtävää

source: Suggestion for other gloss
fi: Ehdotus toiselle glossille

source: Loan Sign
fi: Lainaviittoma

source: Gloss in related language
fi: Glossi liittyvässä kielessä

source: Glosses
fi: Glossit

source: Can Update Video
fi: Voi päivittää videon

source: Can Search/View Full Gloss Details
fi: Voi etsiä/nähdä Glossin täydet tiedot

source: Can export sign details as CSV
fi: Voi viedä viittomien tiedot CSV muodossa

source: Can publish signs and definitions
fi: Voi julkaista viittomia ja määritelmiä

source: Can delete unpub signs or defs
fi: Voi poistaa ei-julkisia viittomia ja määritelmiä

source: Can delete pub signs and defs
fi: Voi poistaa julkisia viittomia ja määritelmiä

source: Include all properties in sign detail view
fi: Sisällytä kaikki ominaisuudet viittoman tarkassa näkymässä

source: Gloss JKL (Eng)
fi: Glossi JKL (Eng)

source: Gloss HKI (Eng)
fi: Glossi HKI (Eng)

source: Comments
fi: Kommentit

source: URL
fi: Internetosoite

source: Handedness
fi: Kätisyys

source: Strong Hand
fi: Dominoiva käsi

source: Weak Hand
fi: Ei-dominoiva käsi

source: Location
fi: Paikka

source: Relation Between Articulators
fi: Artikulaattorien välinen suhde

source: Absolute Orientation: Palm
fi: Absoluuttinen orientaatio: kämmen

source: Absolute Orientation: Fingers
fi: Absoluuttinen orientaatio: sormet

source: Relative Orientation: Movement
fi: Absoluuttinen orientaatio: liike

source: Relative Orientation: Location
fi: Absoluuttinen orientaatio: paikka

source: Orientation Change
fi: Orientaation muutos

source: Handshape Change
fi: Käsimuodon muutos

source: Repeated Movement
fi: Toistollinen liike

source: Movement Shape
fi: Liikkeen muoto

source: Movement Direction
fi: Liikkeen suunta

source: Movement Manner
fi: Liikkeen tapa

source: Contact Type
fi: Kontaktityyppi

source: Phonology Other
fi: Fonologia muu

source: Mouth Gesture
fi: Huulio

source: Mouthing
fi: Huulio sanahahmo

source: Phonetic Variation
fi: Foneettinen variaatio

source: Named Entity
fi: Nimetty kohde

source: Semantic Field
fi: Semanttinen kenttä

source: Number of Occurrences
fi: Esiintymien määrä

source: Number of occurences in annotation materials
fi: Havaintojen määrä annotaatiomateriaaleissa

source: In the Web dictionary
fi: Verkkosanakirjassa

source: Is this a proposed new sign?
fi: Onko tämä ehdotettu uusi viittoma?

source: Please provide some initial data
fi: Kirjoita Glossin alustavat tiedot

source: Add New Sign
fi: Lisää uusi Glossi

source: You do not have sufficient user rights to view this page.
fi: Sinulla ei ole oikeuksia nähdä sivua

source: Lemma ID Gloss
fi: ID Glossi

source: Annotation ID Gloss JKL
fi: Glossi JKL

source: Annotation ID Gloss JKL (English)
fi: Glossi JKL English

source: Annotation ID Gloss HKI
fi: Glossi HKI

source: Annotation ID Gloss HKI (English)
fi: Glossi HKI English

source: Signbank: Search Signs
fi: Signbank: Etsi viittomia

source: Search by Language and Basic Properties
fi: Etsi kielellä ja perusominaisuuksilla

source: Reset
fi: Tyhjennä

source: Results per page
fi: Tuloksia per sivu

source: Number of matches:
fi: Hakutuloksia:

source: Translation equivalents
fi: Käännösvastineet

source: Click on red text to edit
fi: Klikkaa punaista tekstiä editoidaksesi

source: Delete Sign
fi: Poista Glossi

source: Edit
fi: Muokkaa

source: Delete This Sign
fi: Poista tämä Glossi

source: This action will delete this sign and all associated records. It cannot be undone.
fi: Tämä toiminto poistaa Glossin ja kaikki siihen liittyvät tiedot. Toimintoa ei voi peruuttaa.

source: Cancel
fi: Peruuta

source: Confirm Delete
fi: Hyväksy poistaminen

source: Your browser does not support the video tag.
fi: Selaimesi ei tue video tagia.

source: Provide feedback about this sign
fi: Anna palautetta tästä Glossista

source: Report a missing sign
fi: Ilmoita puuttuva viittoma

source: Provide general site feedback
fi: Anna palautetta sivustosta

source: Upload New Video
fi: Lähetä uusi video

source: Upload Video
fi: Lähetä video

source: Delete/Revert Video
fi: Poista/Palauta video

source: This will delete the most recent upload and restore the most recent earlier version.
fi: Tämä toiminto poistaa uusimman videon ja palauttaa sitä edellisen version.

source: videos for this sign.
fi: videota tälle glossille.

source: Delete/Revert this video
fi: Poista/Palauta tämä video

source: Gloss:
fi: Glossi:

source: Gloss JKL:
fi: Glossi JKL:

source: Gloss JKL English:
fi: Glossi JKL English:

source: Gloss HKI:
fi: Glossi HKI:

source: Gloss HKI English:
fi: Glossi HKI English:

source: Translation equivalents in Finnish:
fi: Käännösvastineet suomeksi

source: Translation equivalents in English:
fi: Käännösvastineet englanniksi

source: Comments:
fi: Kommentit

source: Language:
fi: Kieli:

source: Dialect:
fi: Alue:

source: Morphology
fi: Morfologia

source: Delete This Morphology
fi: Poista tämä morfologia

source: Are you sure you want to delete this? This cannot be undone.
fi: Haluatko varmasti poistaa tämän? Toimintoa ei voi peruuttaa.

source: ID Gloss/Annotation ID Gloss
fi: ID Glossi

source: Add Morphology Definition
fi: Lisää morfologia

source: Semantics
fi: Semantiikka

source: Relations to Other Signs
fi: Suhteet viittomiin

source: Delete This Relation
fi: Poista suhde

source: This action will delete the <strong>%(rel.get_role_display)s</strong> relation between %(rel.source)s and %(rel.target)s. It cannot be undone.
fi: Tämä toiminto poistaa <strong>%(rel.get_role_display)s</strong> suhteen %(rel.source)s:n ja %(rel.target)s:n välillä. Sitä ei voida peruuttaa.

source: Add Relation
fi: Lisää suhde

source: Relations to Foreign Signs
fi: Suhteet vieraskielisiin viittomiin

source: Loan
fi: Laina

source: Related language
fi: Lainattu kieli

source: Add Relation to Foreign Sign
fi: Lisää suhde vieraskieliseen viittomaan

source: Frequency
fi: Frekvenssi

source: Publication Status
fi: Julkaisun tilanne

source: In Web Dictionary
fi: Verkkosanakirjassa

source: Proposed New Sign
fi: Ehdotettu uusi viittoma

source: Notes
fi: Muistiinpanot

source: Published
fi: Julkaistu

source: Index
fi: Indeksi

source: Text
fi: Teksti

source: Delete This Note
fi: Poista muistiinpano

source: This action will delete this note. It cannot be undone.
fi: Tämä poistaa muistiinpanon, eikä sitä voida peruuttaa.

source: Enter new note
fi: Kirjoita muistiinpano

source: Save New
fi: Lisää

source: Items marked * below are not in the web version of the dictionary and would not appear in a regular (non staff) search.
fi: Tähdellä (*) merkityt kohdat alapuolell eivät ole sanakirjan julkisessa versiossa eivätkä ne näy julkisessa haussa.

source: Add Tag
fi: Lisää tagi

source: Upload your changed CSV here:
fi: Lähetä muutettu CSV tähän:

source: Submit
fi: Lähetä

source: The following changes were detected:
fi: Seuraavat muutokset havaittiin:

source: Make changes
fi: Tee muutoksia

source: Changes are live.
fi: Muutokset ovat voimassa.

source: Welcome to the Sign Search section of the %(language)s SignBank. Here you can search for a sign using a Dutch translation in the search box above, or browse words starting with any letter below.
fi: Tervetuloa %(language)s SignBankin viittomahakuun. Täällä voit etsiä viittomaa kirjoittamalla käännösvastineen hakuruutuun yläpuolella, tai voit selata sanoja jotka alkavat valitsemallasi kirjaimella.

source: There is no exact match to the word you typed.
fi: Hakemaasi sanaa ei löydy.

source: There are
fi: Täällä on

source: three
fi: kolme

source: two
fi: kaksi

source: main reasons why there may be no match:
fi: syytä sille miksei haulle löytynyt vastineita:

source: There really is no %(language)s sign in the database for which that word is an good translation
fi: %(language)s viittomaa ei löydy tietokannasta, jolle sana olisi hyvä käännös.

source: You have mis-typed the word or you have added unnecessary word endings. Follow these search tips:
fi: Olet kirjoittanut sanan väärin tai olet lisännyt ylimääräisiä päätteitä. Noudata näitä hakuvinkkejä:

source: type only the first few letters of a word
fi: kirjoita vain sanan ensimmäiset kirjaimet

source: type words with no word endings like ‘-en’, ‘-end’, or ‘-t’.
fi: älä käytä sanassa sijapäätteitä.

source: The match is blocked in the public view of %(language)s Signbank because the word/sign is obscene or offensive in Dutch or %(language)s, or both.
fi: Hakutulosta ei voida näyttää julkisessa näkymässä %(language)s Signbankissa, koska sana on epäsiveellinen tai loukkaava suomenkielessä tai %(language)s.

source: There is one word that fully or partially match your query. Please select the word below.
fi: Yksi sana vastaa hakuasi osittain tai kokonaan. Valitse sana alapuolelta.

source: There are %(wordcount)s words that fully or partially match your query.
fi: Löytyi %(wordcount)s sanaa jotka vastaavat hakuasi.

source: Close Window
fi: Sulje ikkuna

source: Replacement of video completed.
fi: Videon korvaaminen valmis.

source: Existing Video
fi: Olemassaoleva video

source: New Video
fi: Uusi video

source: Confirm
fi: Hyväksy

source: Matches for the word <em>%(translation|safe)s
fi: Hakutulokset sanalle <em>%(translation|safe)s

source: Return to Matches
fi: Palaa hakutuloksiin

source: Detail View
fi: Yksityiskohtainen näkymä

source: English Keywords:
fi: Englanninkieliset käännösvastineet

source: Sign Distribution
fi: Viittoman levinneisyys

source: Sign Definition
fi: Viittoman määritelmä

source: Gloss Update Not Allowed
fi: Glossin päivittäminen ei ole sallittua

source: Uknown Language
fi: Tuntematon kieli

source: Unknown Dialect
fi: Tuntematon alue

source: Unknown field
fi: Tuntematon kenttä

source: Bad Relation ID
fi: Epäkelpo ID suhteelle

source: Relation doesn't match gloss
fi: Suhde ei vastaa glossia

source: Badly formed gloss identifier
fi: Huonosti muodostetti glossin tunnistin

source: Unknown form field
fi: Tuntematon lomakekenttä

source: Bad RelationToForeignSign ID
fi: Epäkelpo ID Suhteelle ulkomaisiin viittomiin

source: Bad Definition ID
fi: Epäkelpo määritelmän ID

source: Definition doesn't match gloss
fi: Määritelmä ei vastaa glossia

source: Source gloss not found.
fi: Lähdeglossia ei löytynyt.

source: Target gloss not found.
fi: Kohdeglossia ei löytynyt.

source: Form not valid
fi: Lomake ei ole kelvollinen

source: Incorrect request
fi: Virheellinen pyyntö

source: Bad Morphology Definition ID
fi: Epäkelpo ID morfologialle

source: Morphology Definition doesn't match gloss
fi: Morfologia ei vastaa glossia

source: You are not allowed to see this page.
fi: Sinulla ei ole oikeuksia nähdä tätä sivua.

source: Failed at
fi: Epäonnistuttiin

source: . Could not find
fi: . Ei voitu löytää

source: Failed two overwrite
fi: Päällekirjoitus epäonnistui

source: . Maybe this file is not owned by the webserver?
fi: . Ehkä tämä webpalvelimella ei ole oikeuksia tähän tiedostoon?

source: List keywords
fi: Keyword lista

source: How many hands are used to make this sign?
fi: Montaako kättä viittomassa käytetään?

source: What is the handshape?
fi: Mikä on käsimuoto?

source: What is the handshape of the left hand?
fi: Mikä on vasemman käden käsimuoto?

source: Choose the location of the sign on, or near the body
fi: Onko viittoma lähellä vai kaukana kehosta

source: Choose the location of the right hand on, or near the left hand
fi: Onko oikea käsi vasemman päällä vai lähellä vasenta kättä

source: Contact between hands and body
fi: Käsien ja kehon välinen kontakti

source: Interaction between hands
fi: Käsien interaktio

source: Movement direction of the hand(s)
fi: Käsien liikkeen suunta

source: Type of movement
fi: Liikkeen tyyppi

source: Small movements of the hand(s) and fingers
fi: Pienet käden ja sormien liikkeet

source: Number of movements
fi: Liikkeiden määrä

source: Sign Meaning
fi: Viittoman merkitys

source: Further Details
fi: Lisätietoa

source: yes
fi: kyllä

source: Perhaps
fi: Ehkä

source: Don't know
fi: En tiedä

source: Don't think so
fi: En usko

source: A little
fi: Vähän

source: Don't care
fi: En välitä

source: Not much
fi: Ei paljon

source: Sometimes
fi: Joskus

source: Not Often
fi: Harvoin

source: Don't Know
fi: En tiedä

source: Mostly Correct
fi: Oikein

source: Mostly Wrong
fi: Väärin

source: One handed
fi: Yksikätinen

source: Two handed (same shape for each hand)
fi: Kaksikätinen (samalla käsimuodolla)

source: Two handed (diffent shapes for each hand)
fi: Kaksikätinen (eri käsimuodoilla)

source: None
fi: Ei yhtään

source: Animal
fi: Eläin

source: Please give us your comments about this sign. For example: do you think there are other keywords that belong with this sign? Please write your comments or new keyword/s below.
fi: Anna palautetta viittomasta. Onko muita avainsanoja jotka kuuluvat tähän viittomaan? Kirjoita kommenttisi ja avainsanat alapuolelle.

source: Is there a keyword or keyword/s that DO NOT belong with this sign? Please provide the list of keywords below
fi: Eikö joku avainsana kuulu tähän viittomaan? Listaa avainsanat alapuolelle

source: Where is this sign used?
fi: Missä viittomaa käytetään?

source: Do you like this sign?
fi: Pidätkö tästä viittomasta?

source: Do you use this sign?
fi: Käytätkö tätä viittomaa?

source: If this sign is a suggested new sign, would you use it?
fi: Käyttäisitkö tätä uutena viittomana?

source: Is the information about the sign correct?
fi: Onko viittoman tiedot oikein?

source: Thanks for your comment. We value your contribution.
fi: Kiitos kommentistasi, arvostamme osallistumistanne.

source: General Feedback
fi: Yleinen palaute

source: Please enter any comments you may have about this site and click "submit" to send your feedback to us. We value your contributions and comments.
fi: Kirjoita kommenttisi sivustosta ja paina lähetä. Arvostamme osallistumistanne ja kommenttejanne.

source: General comments, suggestions, or anything you feel like telling us.
fi: Yleiset kommentit ja ehdotukset.

source: Upload your feedback as a video.
fi: Lähetä palautteesi videona.

source: NOTE: Video files can be quite large, and may take a long time to send. Please be patient when submitting this feedback.
fi: HUOM: Videotiedostot voivat olla suuria ja niiden lähettämisessä saattaa kestää tovi. Kärsivällisyyttä.

source: General feedback summary
fi: Yleisen palautteen yhteenveto

source: Date
fi: Päivämäärä

source: User
fi: Käyttäjä

source: Comment
fi: Kommentti

source: We thank you in advance for your contribution and cooperation.
fi: Haluamme kiittää teitä osallistumesta ja yhteistyöstä.

source: Want to tell us what you think of the %(language)s Signbank website or any other signed language related issues? The <a href="generalfeedback.html">General Feedback</a> form is just the place to do it.
fi: Haluatko kertoa mielipiteesi %(language)s Signbankista tai jostain muusta viittomakielisestä ongelmasta? <a href="generalfeedback.html">Yleisen palautteen lomakkeella</a> voit antaa tästä palautetta.

source: Report a Missing Sign
fi: Ilmoita puuttuva viittoma

source: If you know of a sign that isn't in Signbank, you can use the <a href="missingsign.html">Report a Missing Sign</a> form to describe it to us. We will attempt to add as many of your new or missing signs as possible to Signbank. If an addition you suggest is accepted, other visitors to Signbank will then also be able to provide feedback on your sign.
fi: Jos tiedät viittoman joka ei ole Signbankissa, käytä <a href="missingsign.html">Ilmoita puuttuva viittoma</a> lomaketta. Pyrimme lisäämään viittomia palautteen perusteella.

source: Interpreter Feedback Summary
fi: Tulkkipalautteen yhteenveto

source: A list of signs that have at least one Interpreter Note
fi: Lista viittomista joilla on vähintään yksi tulkkipalaute

source: View
fi: Näytä

source: Delete Comment
fi: Poista kommentti

source: Sign Feedback
fi: Palautetta glosseista

source: Sign:
fi: Kirjaudu:

source: Comment:
fi: Kommentti:

source: Don't Belong:
fi: Ei kuulu:

source: Missing Sign Feedback
fi: Palaute puuttuvista viittomista

source: Email:
fi: Sähköposti:

source: Handform
fi: Käsimuoto

source: Handshape
fi: Käden muoto

source: Direction
fi: Suunta

source: Movement Type
fi: Liikkeen tyyppi

source: Small Movement
fi: Pieni liike

source: Repetition
fi: Toisto

source: Meaning
fi: Merkitys

source: You do not have permission to view this page
fi: Sinulla ei ole oikeuksia nähdä tätä sivua

source: Thank you for your feedback.
fi: Kiitos palautteestasi.

source: Please fill out the required questions opposite and then click 'Submit' to report a missing sign to the %(language)s signbank.
fi: Ilmoittaaksesi puuttuvan viittoman %(language)s signbankiin, täytä vastapäiset kysymykset ja paina 'Lähetä'.
